# 1. Наследование - предполагает возможность определения дочерних классов;
# 2. Полиморфизм - предполагает разный способ реализации одного и того же класса;
# 3. Инкапсуляция - предполагает сокрытие данных и объединение данных и их методов;

# 4. Композиция - (реализуется реже) означает возможность создания объектов, составными
# частями которых являються объекты других классов;

# Конструктор - в ООП называют метод класса, который вызывается автоматически при создании
# объекта от этого класса.
